import type { Message } from "../types/Message.ts"

export const messages: Message[] = [
    {
        id: 0,
        time: new Date(2025, 12, 15, 22, 52),
        author: "Андрій ріпка",
        text: "Я зрозумію що треба отправілать вам домашніе завдання прямо туда в Гугл Документи",
        isOwner: false,
    },
    {
        id: 1,
        time: new Date(2025, 12, 15, 22, 54),
        author: "каримка",
        text: "зрозумій братан💪🏾💪🏾",
        isOwner: false,
    },
    {
        id: 2,
        time: new Date(2025, 12, 15, 22, 59),
        author: "Андрій ріпка",
        text: "Я отправілаю вам домашніе завдання прямо туда в Гугл Документи они бачить или не Олександр",
        isOwner: false,
    },
    {
        id: 3,
        time: new Date(2025, 12, 15, 23, 40),
        author: "Oleksandr",
        text: "бачу",
        isOwner: true,
    },
    {
        id: 4,
        time: new Date(2025, 12, 15, 23, 50),
        author: "Андрій ріпка",
        text: "Ну як вам домашніе завдання моий",
        isOwner: false,
    },
    {
        id: 5,
        time: new Date(2025, 12, 15, 23, 51),
        author: "Oleksandr",
        text: "в нормі",
        isOwner: true,
    },
    {
        id: 6,
        time: new Date(2025, 12, 15, 23, 59),
        author: "Андрій ріпка",
        text: "Я зрозумію що я не погано зробив все",
        isOwner: false,
    },
]